CREATE DATABASE `secondhand` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
create table user(
    id int(4) not null primary key auto_increment,
    username varchar(20) not null
);

create table goods(
    id int(4) not null primary key auto_increment,
    user_id int (4) not null,
    goods_category_id int(4) not null,
    telphone varchar (20) not null,
    money decimal(5,2) not null,
    trade_address varchar(200) not null,
    goods_describe varchar(200) not null,
    goods_picture_address varchar(100) not null,
    create_time datetime,
    update_time datetime,
    goods_status int (4) COMMENT '0待审核，1审核通过，2交易完成(删除)',
    FOREIGN KEY (user_id) REFERENCES user(id),
    FOREIGN KEY (goods_category_id) REFERENCES category(id)
);



create table category(
    id int(4) not null primary key auto_increment,
    category_name varchar(20) not null
);


insert into category(category_name) values("电子产品"),("日用品"),("学习用品")

insert into user(username) values("zhang"),("wang");



insert into goods(user_id,
                    goods_category_id,
                    telphone,
                    money,
                    trade_address,
                    goods_describe,
                    goods_picture_address,
                    create_time,
                    update_time,
                    goods_status)
        values (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0),
        (1,1,"13423454543",10000,"302宿舍","着急出手手机一个","/data/p/ass.png","2016-08-06 12:12:12","2016-08-06 12:12:12",0);


